# n = 10
# while n > 0:
#     print("*" * n )
#     n -= 1
##############
# for i in range(10):
#     print("*" * i )
#     i-=1

############
# for x in range(2):
#     for i in range(1,10):
#         while i-1==0:
#             print("*",end=" ")
#     print("\n")
#############
# m=10
# for i in range(m):
#     print("*")
#     for j in range(m):
#          print(i+j)
#####################
n=5
for i in range(n):
    star=" *"*i
    space=" " * (n-i)
    print(space+star)
# "ما یه حلقه تکرا داریم یعنی تعداد بار های تکرار که اسمشو i میذاریم
# حالا
#
# که i رو هر عدیی بذاریم به همون مقدار خط میسازه
# حالا تعداد خط هارو اکه منهای  تعداد
# تکرار یعنی i کنیم
# چالش اصلی ساخت این مثلث اسپیس هاس
# که خط اول یه ستاره در مرکز باشه خط دوم ۳ ستاره  و …
# برای ساخت این اسپیس ها
#
# بار اول بر فرض i=5
# 5-1=4
# بار دوم
# 5-2=3
# در اخر
# 5-5=0 بدون فاصله
# و….
#
#
# و برای تعداد صحیح ستاره ها که تو خط دوم ۳ تاشه و در خط اهر 5تا
# ستاره ها i برابر شن
# یعنی ضرب شه در i"
