# n = 10
# while n > 0:
#     print("*" * n )
#     n -= 1
#####################
# n=5
# for i in range(n):
#     star=" *"*i
#     space=" " * (n-i)
#     print(space+star)
# # "ما یه حلقه تکرا داریم یعنی تعداد بار های تکرار که اسمشو i میذاریم
# حالا
#
# که i رو هر عدیی بذاریم به همون مقدار خط میسازه
# حالا تعداد خط هارو اکه منهای  تعداد
# تکرار یعنی i کنیم
# چالش اصلی ساخت این مثلث اسپیس هاس
# که خط اول یه ستاره در مرکز باشه خط دوم ۳ ستاره  و …
# برای ساخت این اسپیس ها
#
# بار اول بر فرض i=5
# 5-1=4
# بار دوم
# 5-2=3
# در اخر
# 5-5=0 بدون فاصله
# و….
# و برای تعداد صحیح ستاره ها که تو خط دوم ۳ تاشه و در خط اهر 5تا
# ستاره ها i برابر شن
# یعنی ضرب شه در i"
############################
def how_to_enumrate():
    print("روش اول: داخل لیست")
    list1=["asus","touph","Rog"]
    print(list(enumerate(list1)))
    print("روش دوم: خارج از لیست")
    for enu,value in enumerate(list1,start=1):
        print(enu,value)
    #     var_enumrate=list(enumerate(value))
    #     print(var_enumrate)
how_to_enumrate()